# TIME SERIES DATA Cleaning

In [58]:
#import libraries 

import pandas as pd
import pytz

## Data Wrangling

The data is stored in csv files therefore we will wrangle the data with pandas

In [59]:
df1 = pd.read_csv("data/tmp_424i9_2.csv")

In [60]:
df1.head()

  sensor_id;sensor_type;location;lat;lon;timestamp;value_type;value
0  158;pms5003;33;-1.255;36.693;2023-02-01T00:00:...
1  158;pms5003;33;-1.255;36.693;2023-02-01T00:00:...
2  158;pms5003;33;-1.255;36.693;2023-02-01T00:00:...
3  103;SDS011;7;-1.298;36.791;2023-02-01T00:00:39...
4  103;SDS011;7;-1.298;36.791;2023-02-01T00:00:39...

In [61]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440898 entries, 0 to 440897
Data columns (total 1 columns):
 #   Column                                                             Non-Null Count   Dtype
---  ------                                                             --------------   -----
 0   sensor_id;sensor_type;location;lat;lon;timestamp;value_type;value  440898 non-null  object
dtypes: object(1)
memory usage: 3.4+ MB

We will need to do some data cleaning. its a csv file putting all the data into a single string and column, 
luckily theres no NAN/ missing values.

But first lets use a function to get all the data we need.Then use the code created for cleaning data to provide a wholesome clean dataset to explore and work with.

## Data Cleaning

In [62]:
# split the columns
df1_split = df1["sensor_id;sensor_type;location;lat;lon;timestamp;value_type;value"].str.split (';', expand= True)

#rename the columns 
df1_split.columns = ["sensor_id", "sensor_type", "location","lat", "lon", "timestamp", "value_type", "value"]

df1_split.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440898 entries, 0 to 440897
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   sensor_id    440898 non-null  object
 1   sensor_type  440898 non-null  object
 2   location     440898 non-null  object
 3   lat          440898 non-null  object
 4   lon          440898 non-null  object
 5   timestamp    440898 non-null  object
 6   value_type   440898 non-null  object
 7   value        440898 non-null  object
dtypes: object(8)
memory usage: 26.9+ MB

In [63]:
df1_split.head()

,sensor_id,sensor_type,location,lat,lon,timestamp,value_type,value
0,158,pms5003,33,-1.255,36.693,2023-02-01T00:00:35.980314+00:00,P2,73.40
1,158,pms5003,33,-1.255,36.693,2023-02-01T00:00:35.980314+00:00,P1,89.00
2,158,pms5003,33,-1.255,36.693,2023-02-01T00:00:35.980314+00:00,P0,69.40
3,103,SDS011,7,-1.298,36.791,2023-02-01T00:00:39.779205+00:00,P2,4
4,103,SDS011,7,-1.298,36.791,2023-02-01T00:00:39.779205+00:00,P1,4

Now we need to access the data type of each variable. The value type, location, sensor type and sensor_id can remain as strings(object). the rest will be changed accordingly.

In [64]:
# change the value column data to float 
df1_split[["value", "lat", "lon"]] = df1_split[["value", "lat", "lon"]].astype(float)

df1_split.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440898 entries, 0 to 440897
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   sensor_id    440898 non-null  object
 1   sensor_type  440898 non-null  object
 2   location     440898 non-null  object
 3   lat          440898 non-null  float64
 4   lon          440898 non-null  float64
 5   timestamp    440898 non-null  object
 6   value_type   440898 non-null  object
 7   value        440898 non-null  float64
dtypes: float64(3), object(5)
memory usage: 26.9+ MB

In [65]:
# change timestamp to datetime fortmat 
df1_split["timestamp"]= pd.to_datetime(df1_split["timestamp"], errors = "coerce")

In [66]:
df1_split.set_index("timestamp", inplace=True)

In [67]:
df1_split.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 440898 entries, 2023-02-01 00:00:35.980314+00:00 to 2023-02-28 23:56:18.379591+00:00
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   sensor_id    440898 non-null  object
 1   sensor_type  440898 non-null  object
 2   location     440898 non-null  object
 3   lat          440898 non-null  float64
 4   lon          440898 non-null  float64
 5   value_type   440898 non-null  object
 6   value        440898 non-null  float64
dtypes: float64(3), object(4)
memory usage: 26.9+ MB

In [68]:
if df1_split.index.tz is None:
    df1_split.index = df1_split.index.tz_localize("UTC")

In [69]:
# change timezone to EAT 
df1_split.index = df1_split.index.tz_convert("Africa/Nairobi")

In [70]:
df1_split.head()

,sensor_id,sensor_type,location,lat,lon,value_type,value
timestamp,,,,,,,
2023-02-01 03:00:35.980314+03:00,158,pms5003,33,-1.255,36.693,P2,73.4
2023-02-01 03:00:35.980314+03:00,158,pms5003,33,-1.255,36.693,P1,89.0
2023-02-01 03:00:35.980314+03:00,158,pms5003,33,-1.255,36.693,P0,69.4
2023-02-01 03:00:39.779205+03:00,103,SDS011,7,-1.298,36.791,P2,4.0
2023-02-01 03:00:39.779205+03:00,103,SDS011,7,-1.298,36.791,P1,4.0

In [76]:
df1_split["value_type"].unique()

array(['P2', 'P1', 'P0', 'humidity', 'temperature'], dtype=object)

In [79]:
df1_split.drop(columns = ["location", "sensor_type", "sensor_id", 'lat', "lon"], inplace=True)

In [57]:
df1_split.head()

                                 value_type  value
timestamp
2023-02-01 03:00:35.980314+03:00         P2   73.4
2023-02-01 03:00:35.980314+03:00         P1   89.0
2023-02-01 03:00:35.980314+03:00         P0   69.4
2023-02-01 03:00:39.779205+03:00         P2    4.0
2023-02-01 03:00:39.779205+03:00         P1    4.0

In [ ]:
# df1_split = df1_split > 500

In [80]:
df1_split_p2 = df1_split[df1_split["value_type"] == "P2"]
df1_split_p2

                                 value_type  value
timestamp
2023-02-01 03:00:35.980314+03:00         P2   73.4
2023-02-01 03:00:39.779205+03:00         P2    4.0
2023-02-01 03:03:07.986144+03:00         P2   71.5
2023-02-01 03:03:19.729805+03:00         P2    3.0
2023-02-01 03:05:40.234854+03:00         P2   72.0
...                                     ...    ...
2023-03-01 02:54:41.380829+03:00         P2   15.4
2023-03-01 02:54:41.604245+03:00         P2   71.0
2023-03-01 02:55:13.380789+03:00         P2   15.0
2023-03-01 02:55:45.429267+03:00         P2   13.0
2023-03-01 02:56:17.438376+03:00         P2   12.6

[91161 rows x 2 columns]

In [78]:
df1_split_p2 = df1_split[df1_split["value"]< 500]

In [81]:
df1_split_p2= df1_split_p2.rename(columns = {"value":"P2"})

In [82]:
df1_split_p2.head()

                                 value_type    P2
timestamp
2023-02-01 03:00:35.980314+03:00         P2  73.4
2023-02-01 03:00:39.779205+03:00         P2   4.0
2023-02-01 03:03:07.986144+03:00         P2  71.5
2023-02-01 03:03:19.729805+03:00         P2   3.0
2023-02-01 03:05:40.234854+03:00         P2  72.0

In [84]:
df1_split_p2.drop(columns = ["value_type"], inplace=True)

In [85]:
df1_split_p2

                                    P2
timestamp
2023-02-01 03:00:35.980314+03:00  73.4
2023-02-01 03:00:39.779205+03:00   4.0
2023-02-01 03:03:07.986144+03:00  71.5
2023-02-01 03:03:19.729805+03:00   3.0
2023-02-01 03:05:40.234854+03:00  72.0
...                                ...
2023-03-01 02:54:41.380829+03:00  15.4
2023-03-01 02:54:41.604245+03:00  71.0
2023-03-01 02:55:13.380789+03:00  15.0
2023-03-01 02:55:45.429267+03:00  13.0
2023-03-01 02:56:17.438376+03:00  12.6

[91161 rows x 1 columns]

files= glob("data/mexico-city-real-estate-*.csv")
files

A function to do the entire data cleaning for all the files

In [1]:
def wrangle(filepath):
    # read_csv file
    df=pd.read_csv(filepath)
    
    # split the columns
    df= df["sensor_id;sensor_type;location;lat;lon;timestamp;value_type;value"].str.split (';', expand= True)

    #rename the columns 
    df.columns = ["sensor_id", "sensor_type", "location","lat", "lon", "timestamp", "value_type", "value"]
    
    # change the value column data to float 
    df["value"] = df["value"].astype(float)
    
    # change timestamp to datetime fortmat 
    df["timestamp"]= pd.to_datetime(df["timestamp"], errors = "coerce")
    
    # change the index to be timestamp
    df.set_index("timestamp", inplace=True)
    
    # To avoid errors ensure timestamp has timezone
    if df.index.tz is None:
        df.index = df.index.tz_localize("UTC")
    # change timezone to EAT(Nairobi) 
    df.index = df.index.tz_convert("Africa/Nairobi")
    
    # View only P2 Values 
    df= df[df["value_type"] == "P2"]

    # We need values less than 500
    df = df[df["value"]< 500]
    
    #rename the 'value' column to P2
    df= df.rename(columns = {"value":"P2"})
    
    # drop redudant columns for the experiment
    df.drop(columns = ["location", "sensor_type", "sensor_id", 'lat', "lon", "value_type"], inplace=True)
    
    return df